## Staging: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                               |
|--------|-----------------------------------------------------------------|
| update | `aws_lambda_alias.api_provisioned_latest`                       |
|        | `module.scan_files[&quot;api&quot;].aws_lambda_function.this`             |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_lambda_function.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_alias.api_provisioned_latest will be updated in-place
  ~ resource "aws_lambda_alias" "api_provisioned_latest" {
      ~ function_version = "98" -> (known after apply)
        id               = "arn:aws:lambda:ca-central-1:127893201980:function:scan-files-api-provisioned:latest"
        name             = "latest"
        # (4 unchanged attributes hidden)
    }

  # module.scan_files["api"].aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "scan-files-api"
        tags                           = {
            "CostCentre" = "scan-files-staging"
            "Terraform"  = "true"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "LOG_LEVEL"                    = "INFO" -> "WARNING"
                # (12 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.scan_files["api-provisioned"].aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "scan-files-api-provisioned"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:127893201980:function:scan-files-api-provisioned:98" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:127893201980:function:scan-files-api-provisioned:98/invocations" -> (known after apply)
        tags                           = {
            "CostCentre" = "scan-files-staging"
            "Terraform"  = "true"
        }
      ~ version                        = "98" -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "LOG_LEVEL"                    = "INFO" -> "WARNING"
                # (12 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

logging is deprecated. Use the aws_s3_bucket_logging resource instead.

(and 8 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_dkr"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sts"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_ip_set.ip_allowlist"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns"]

28 tests, 19 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
